<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"> 

<html>

	<head>
	
		<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
		<meta name="title" content="Adobe Read Me File" />
		<meta name="description" content= "Adobe products provide ... " />
		<title>Viktigt om Adobe Device Central</title>
		<style type="text/css" media="screen">

/***********************  fonts  ************************/		
	body 
    {font-family: Arial, Verdana, Helvetica, sans-serif;
	 font-weight: normal;
	 font-size: 10pt;
	 color: #000000;
     margin: 0px;
	 background-color: white;}
	
	h1
	{display:inline;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: normal;
	color: #999999;}
	
	h2 
	{display:inline;
	font-size: 10pt;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: bold;
	color: #666666;}


/***********************  links  ************************/		
	
	a:link 
	{color:#004477;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:visited
	{color:#6d7f8e;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:hover 
	{color:#ff0000;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}

/***********************  div tags  ************************/		
	#page
	{float:left;
	width:700px;
	margin:20px 20px 20px 20px;}
	
	#subTitle
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#title
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#description
	{float:left;
	width:700px;
	padding:15px 0px 15px 0px;}


</style>
		
	</head>
	
<body>
	
<div id="page">
	<h1><span style="font-size:20pt">Adobe<sup>&reg;</sup></span></h1><br/>
			<div id="subTitle 1">
				<h1><span style="font-size:16pt">Viktigt om Device Central CS3</span></h1>
				<br/>
			</div>
			<div id="description">V&auml;lkommen till Adobe&reg; Device Central CS3. Det h&auml;r dokumentet inneh&aring;ller sent inkommen produktinformation, uppdateringar och fels&ouml;kningstips som inte finns med i produktdokumentationen.<br/> <br/> <a href="#A1">Minimisystemkrav</a><br/> <a href="#A2">Installera programvaran</a><br/> <a href="#A3">Avinstallera programvaran</a><br/> <a href="#A6">QuickTime-installation </a><br/> <a href="#A7">Teckensnittsemulering</a><br/> <a href="#A8">K&auml;nda problem</a><br/> <a href="#A9">Kundtj&auml;nst</a><br/> <a href="#A10">Andra resurser</a><br/> <a href="#A11">Juridiska meddelanden </a>
			</div>
			<div id="title">
				<a name="A1" id="A1"></a><h2>L&auml;gsta systemkrav</h2>
			</div>
			<div id="description">
				Device Central kan bara installeras som komponent till en Adobe&reg; CS3-produkt eller med Adobe&reg; Creative Suite 3. L&auml;s d&auml;rf&ouml;r systemkraven f&ouml;r den Adobe-produkt som du installerar Device Central med.
				
			</div>
			<div id="title">
				<a name="A2" id="A2"></a><h2>Installera programvaran</h2>
			</div>
			<div id="description">Device Central kan bara installeras som komponent till en Adobe&reg; CS3-produkt eller Adobe&reg; Creative Suite 3.<br/>
				<ol>
					<li>Innan du installerar st&auml;nger du alla program som k&ouml;rs p&aring; ditt system &ndash; inklusive andra Adobe-program, Microsoft Office-program och webbl&auml;sarf&ouml;nster.</li>
					<li>G&ouml;r n&aring;got av f&ouml;ljande:</li>
					<ul>
						<li>S&auml;tt i cd- eller dvd-skivan i enheten och f&ouml;lj anvisningarna p&aring; sk&auml;rmen. (Om installationsprogrammet inte startar automatiskt dubbelklickar du p&aring; Setup.exe (Windows) eller Setup (Mac OS) p&aring; enhetens rotniv&aring;).</li>
						<li>Om du laddade ned programmet fr&aring;n n&auml;tet &ouml;ppnar du mappen och dubbelklickar p&aring; Setup.exe (Windows) eller Setup (Mac OS) och f&ouml;ljer sedan anvisningarna p&aring; sk&auml;rmen.
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A3" id="A3"></a><h2>Avinstallera programvaran</h2>
			</div>
			<div id="description">
				<ol>
					<li>Innan du avinstallerar st&auml;nger du alla program som k&ouml;rs p&aring; ditt system &ndash; inklusive andra Adobe-program, Microsoft Office-program och webbl&auml;sarf&ouml;nster.</li>
					<li>G&ouml;r n&aring;got av f&ouml;ljande:</li>
					<ul>
						<li>G&aring; till Kontrollpanelen i Windows och dubbelklicka p&aring; L&auml;gg till eller ta bort program. Markera den produkt du vill avinstallera, klicka p&aring; &Auml;ndra/ta bort och f&ouml;lj sedan anvisningarna p&aring; sk&auml;rmen.</li>
						<li>I Mac OS dubbelklickar du p&aring; produktinstalleraren i Applications\Utilities\Adobe Installers. Verifiera som administrat&ouml;r och v&auml;lj sedan alternativet f&ouml;r att avinstallera komponent och f&ouml;lj anvisningarna p&aring; sk&auml;rmen.<br/>
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A6" id="A6"></a><h2>QuickTime-installation </h2>
			</div>
			<div id="description">
				F&ouml;r att spela upp video i Device Central kr&auml;vs att Apple QuickTime Player version 7 eller h&ouml;gre &auml;r installerad p&aring; systemet. Du m&aring;ste installera QuickTime f&ouml;r att kunna spela upp video och vissa ljudformat i dina Flash Lite-dokument. Du installerar QuickTime genom att g&aring; till Apples nedladdningssida p&aring; <a href="http://www.apple.com/quicktime/download">http://www.apple.com/quicktime/download</a>. F&ouml;lj sedan installationsanvisningarna.
				
			</div>
			<div id="title">
				<a name="A7" id="A7"></a><h2>Teckensnittsemulering</h2>
			</div>
			<div id="description">F&ouml;r att teckensnitten som &auml;r definierade i dina Flash-dokument ska emuleras korrekt, m&aring;ste du se till att &ouml;nskade teckensnitt &auml;r installerade p&aring; systemet. Om ett av Flash generiska enhetsteckensnitt (_sans, _serif, _typewriter) anv&auml;nds i en Flash-film, ers&auml;tts de i Flash Lite av ett teckensnitt som finns p&aring; systemet. Eftersom de flesta inbyggda enhetsteckensnitt &auml;gs av tillverkaren kanske de inte finns p&aring; din dator. Inst&auml;llningarna f&ouml;r Device Central tillhandah&aring;ller mappning av vanliga teckensnitt i Windows och Mac OS f&ouml;r de tre generiska enhetsteckensnitten. Om du har ett enhetsteckensnitt fr&aring;n en tillverkare installerat p&aring; datorn, eller helt enkelt vill anv&auml;nda ett annat teckensnitt som standard, g&aring;r du till inst&auml;llningarna f&ouml;r Device Central och mappar om de generiska teckensnittstyperna. Mappning av teckensnitt st&ouml;ds f&ouml;r olika spr&aring;k. Du kan bara mappa teckensnitt som &auml;r installerade p&aring; datorn och som &ouml;verensst&auml;mmer med det valda spr&aring;kets kodning.
			</div>
			<div id="title">
				<a name="A8" id="A8"></a><h2>K&auml;nda fel</h2>
			</div>
			<div id="description">
				<strong>Spelare </strong>
				<ul>
					<li>Flash Lite 1 och Flash Lite 2.x-spelare returnerar alltid &quot;false&quot; f&ouml;r funktionen <tt>_capStreamSound</tt> oavsett informationen i enhetsprofilen. </li>
					<li>Flash Lite 2.x-spelare returnerar alltid &quot;true&quot; f&ouml;r egenskapen <tt>System.capabilities.hasStreamingAudio</tt> oavsett informationen i enhetsprofilen.  </li>
					<li>Flash Lite 2.x-spelare returnerar alltid &quot;true&quot; f&ouml;r systemfunktionen <tt>hasQWERTYKeyboard</tt> oavsett informationen i enhetsprofilen. </li>
				</ul>
				<strong>Indata </strong>
				<ul>
					<li>P&aring; vissa enheter kan det h&auml;nda att funktionen <tt>mouseType</tt> inte emuleras korrekt om &lt;mouseType value=&quot;Partial&quot;/&gt;. Det inneb&auml;r att de mush&auml;ndelser som st&ouml;ds i emulatorn kan skilja sig fr&aring;n dem som st&ouml;ds p&aring; enheten. Kontrollera alltid att mush&auml;ndelserna fungerar som de ska p&aring; enheten.</li>
					<li>Systemfunktionen <tt>hasStylus</tt> returnerar &quot;false&quot; om &lt;mouseType value=&quot;Stylus&quot;/&gt;.</li>
					<li>Device Central kontrollerar inte om den testade filen &ouml;verensst&auml;mmer med de strikta namnkonventionerna f&ouml;r BREW-enheter. Om du vill ange BREW-enheter som m&aring;l m&aring;ste du se till att filen f&ouml;ljer BREW-reglerna.</li>
				</ul>
				<strong>Videor och bilder i en SWF-fil</strong><br/> Videor och bilder i en SWF-fil spelas alltid upp i emulatorn, oavsett om det finns st&ouml;d f&ouml;r detta i enheten. Du kan se efter om det finns st&ouml;d f&ouml;r video och bilder i en SWF-fil genom att markera m&aring;lenhet/er, klicka p&aring; fliken Enhetsprofiler och g&aring; till Flash-avsnittet. Om video och bilder i en SWF-fil st&ouml;ds, visas respektive format i en lista. <br/><br/><strong>SWF-inneh&aring;ll p&aring; webbsidor</strong> <br/>P&aring; Windows spelar inte emulatorn upp Flash-inneh&aring;ll som &auml;r inb&auml;ddat p&aring; webbsidor. P&aring; Mac OS anv&auml;nder Device Central Flash-till&auml;ggsprogrammet vilket kan ge ov&auml;ntade resultat f&ouml;r Flash Lite-inneh&aring;llet. <br/> <br/>Vi rekommenderar att du testar inb&auml;ddat Flash Lite-inneh&aring;ll separat. <br/><br/><strong>Ljud</strong>
				<ul>
					<li>BREW-specifika ljudformat som QCELP, CMX och BCI spelas inte upp.</li>
					<li>Funktionen <tt>soundChannels</tt> returneras alltid som &quot;Stereo&quot;, oavsett om enhetsprofilen endast anger st&ouml;d f&ouml;r monoljud.</li>
					<li>Flash Lite 1.1-spelaren returnerar alltid &quot;Yes&quot; f&ouml;r funktionen <tt>multipleDeviceSounds</tt> &auml;ven om enhetsprofilen visar att det inte finns st&ouml;d f&ouml;r blandning av flera ljud.</li>
					<li>SWF-filer med flera inbyggda inb&auml;ddade PCM RAW-ljud som ska spelas upp p&aring; samma g&aring;ng (mixning) kan f&ouml;rs&auml;mra uppspelningskvaliteten p&aring; Flash Lite 2.x-spelare.</li>
					<li>Kvalitetsproblem kan ocks&aring; f&ouml;rekomma n&auml;r MIDI-filer spelas upp. Du kan f&ouml;rb&auml;ttra kvaliteten genom att &auml;ndra standardsynthesizern i systeminst&auml;llningarna f&ouml;r QuickTime till General MIDI.</li>
					<li>P&aring; Mac OS kan det h&auml;nda att mindre delar av ljudet hoppas &ouml;ver i b&ouml;rjan.</li>
					<li>P&aring; Mac OS kan du f&aring; problem med kvaliteten p&aring; Flash Lite 2.x-spelare n&auml;r du spelar upp inbyggda MP3-, MFI- och MIDI-format.</li>
					<li>P&aring; Mac Power-datorer kan SMAF-5-filer hoppas &ouml;ver och klippas bort under uppspelningen.</li>
					<li>Ljuduppspelningen kan bli hackig n&auml;r programf&ouml;nstret snabbt dras runt p&aring; sk&auml;rmen. </li>
				</ul>
				<strong>Prestanda</strong> <br/>Varje enhetsprofil inneh&aring;ller information om prestandaindex, vilket &auml;r resultatet av ett prestandatest som Adobe k&ouml;rt p&aring; enheten i fr&aring;ga. Med hj&auml;lp av prestandaindexet kan man kategorisera enheter. Ju h&ouml;gre index, desto b&auml;ttre prestanda. Om du vill simulera enhetsprestanda p&aring; datorn m&aring;ste du f&ouml;rst k&ouml;ra en kalibreringsprocess. Under kalibreringsprocessen k&ouml;r Device Central samma SWF-fil som anv&auml;ndes under prestandatestet p&aring; enheten. Resultatet av kalibreringen p&aring; datorn j&auml;mf&ouml;rs sedan med enhetens prestandaindex. <br/> <br/><i>Obs! prestandasimulering &auml;r en uppskattning av den verkliga enhetsprestandan.<br/></i><br/> SWF-filen som anv&auml;nds f&ouml;r kalibrering inneh&aring;ller text, bitmappar och vektorinpoleringar. D&auml;rf&ouml;r passar prestandasimuleringen b&auml;st f&ouml;r den typen av inneh&aring;ll. Funktionaliteten, t.ex. XML-analys, ActionScript och n&auml;tverk ing&aring;r inte i det h&auml;r prestandatestet. <br/> <br/> F&ouml;r att f&aring; de mest exakta simuleringsresultaten b&ouml;r du utf&ouml;ra enhetskalibrering regelbundet, eftersom andra processer som k&ouml;rs p&aring; din dator p&aring;verkar prestandan. Den slutliga testningen m&aring;ste alltid utf&ouml;ras p&aring; enheten i fr&aring;ga.<br/> <br/><strong>FSCommand2-kommandon </strong><br/> SetFullScreen: SWF-filerna emuleras som om de var inst&auml;llda p&aring; helsk&auml;rmsl&auml;ge.<br/>
				
				<br/>SetInputTextType: Emulatorn ignorerar testindatarestriktioner f&ouml;r latinska/icke-latinska tecken.<br/> <br/>
				
				F&ouml;ljande FSCommand2-kommandon emuleras som om det fanns st&ouml;d f&ouml;r dem, &auml;ven om det st&aring;r annorlunda i enhetsprofilen.<br/>
				
				<br/>Alla Flash Lite-spelare: 
				
				<ul>
					<li>Escape, Unescape&nbsp;</li>
					<li>GetFreePlayerMemory, GetTotalPlayerMemory</li>
					<li>GetTimezoneOffset<br/>
					</li>
				</ul>
				Flash Lite 2.x-spelare:
				
				<ul>
					<li>GetDateDay, GetDateMonth, GetDateWeekday, GetDateYear</li>
					<li>GetTimeHour, GetTimeMinute, GetTimeSecond
					</li>
				</ul>
			</div>
			<div id="title">
				<a name="A9" id="A9"></a><h2>Kundtj&auml;nst</h2>
			</div>
			<div id="description">
				<strong>Kundtj&auml;nst</strong><br/> Adobes kundtj&auml;nst hj&auml;lper dig med produktinformation, f&ouml;rs&auml;ljning, registrering och andra icke-tekniska fr&aring;gor. Information om hur du kontaktar kundtj&auml;nst f&aring;r du om du g&aring;r till huvudsidan f&ouml;r Adobe.com f&ouml;r ditt land eller region, och klickar p&aring; 'Kontakt'.<br/> <br/> <strong>Supportplanalternativ och tekniska resurser</strong><br/> Om du beh&ouml;ver teknisk hj&auml;lp med en produkt, inklusive information om kostnadsfri eller avgiftsbelagd support och fels&ouml;kningsresurser, hittar du mer information p&aring; <a href="http://www.adobe.com/go/support_se/">http://www.adobe.com/go/support_se/</a>. Utanf&ouml;r Nordamerika <a href="http://www.adobe.com/go/intlsupport_se/">http://www.adobe.com/go/intlsupport_se/</a>. Kostnadsfria fels&ouml;kningsresurser omfattar Adobes supportdatabas, Adobes anv&auml;ndarforum och mycket mer.</div>
			<div id="title">
				<a name="A10" id="A10"></a><h2>Andra resurser</h2>
			</div>
			<div id="description">
				<strong>Dokumentation</strong><br/> Best&auml;ll tryckt dokumentation p&aring; <a href="http://www.adobe.com/go/buy_books_se">www.adobe.com/go/buy_books_se</a>.<br/> <br/> <strong>Onlineresurser</strong><br/>Mobile and Devices Developer Center p&aring; <a href="http://www.adobe.com/go/mobiledeveloper_se">www.adobe.com/go/mobiledeveloper_se</a>.<a href="http://www.adobe.com/go/mobiledeveloper_se"><br/></a>Developer Center p&aring; <a href="http://www.adobe.com/go/developer_se">www.adobe.com/go/developer_se</a>.</div>
			<div id="title">
				<a name="A11" id="A11"></a><h2>Juridiska meddelanden</h2>
			</div>
			<div id="description">
				Bilder av mobila enheter medföljer endast programvaran för simulering och kanske inte utnyttjar Adobe-teknik när de börjar säljas av enhetstillverkaren.<br/>
				<br/> Uppdaterad information/Ytterligare information om tredjepartskod finns p&aring; <a href="http://www.adobe.com/go/thirdparty_se/">www.adobe.com/go/thirdparty_se</a>.</div>
		</div>
	
</body>

</html>
	  
	