<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"> 

<html>

	<head>
	
		<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
		<meta name="title" content="Adobe Read Me File" />
		<meta name="description" content= "Adobe products provide ... " />
		<title>Fichier Lisez-moi pour Adobe Device Central</title>
		<style type="text/css" media="screen">

/***********************  fonts  ************************/		
	body 
    {font-family: Arial, Verdana, Helvetica, sans-serif;
	 font-weight: normal;
	 font-size: 10pt;
	 color: #000000;
     margin: 0px;
	 background-color: white;}
	
	h1
	{display:inline;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: normal;
	color: #999999;}
	
	h2 
	{display:inline;
	font-size: 10pt;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: bold;
	color: #666666;}


/***********************  links  ************************/		
	
	a:link 
	{color:#004477;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:visited
	{color:#6d7f8e;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:hover 
	{color:#ff0000;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}

/***********************  div tags  ************************/		
	#page
	{float:left;
	width:700px;
	margin:20px 20px 20px 20px;}
	
	#subTitle
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#title
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#description
	{float:left;
	width:700px;
	padding:15px 0px 15px 0px;}


</style>
		
	</head>
	
<body>
	
<div id="page">
	<h1><span style="font-size:20pt">Adobe<sup>&reg;</sup></span></h1><br/>
			<div id="subTitle 1">
				<h1><span style="font-size:16pt">Fichier Lisez-moi pour Device Central CS3</span></h1>
				<br/>
			</div>
			<div id="description">Bienvenue dans Device Central CS3 d'Adobe&reg;. Ce document contient les derni&egrave;res informations sur les produits, des mises &agrave; jours et des conseils de d&eacute;pannage qui ne figurent pas dans la documentation du produit.<br/> <br/> <a href="#A1">Configuration minimale requise</a><br/> <a href="#A2">Installation du logiciel</a><br/> <a href="#A3">D&eacute;sinstallation du logiciel</a><br/> <a href="#A6">Installation de QuickTime</a><br/> <a href="#A7">Emulation des polices</a><br/> <a href="#A8">Probl&egrave;mes connus</a><br/> <a href="#A9">Assistance client&egrave;le</a><br/> <a href="#A10">Autres ressources</a><br/> <a href="#A11">Informations juridiques </a> <br/>
			</div>
			<div id="title">
				<a name="A1" id="A1"></a><h2>Configuration minimale requise</h2>
			</div>
			<div id="description">
				Vous ne pouvez installer Device Central qu'en tant que composant d'un produit Adobe&reg; CS3 ou avec Adobe&reg; Creative Suite 3.
 Vous devez donc consulter la configuration requise du produit Adobe pour lequel vous installez Device Central.				
			</div>
			<div id="title">
				<a name="A2" id="A2"></a><h2>Installation du logiciel</h2>
			</div>
			<div id="description">Vous ne pouvez installer Device Central qu'en tant que composant d'un produit Adobe&reg; CS3 ou d'Adobe&reg; Creative Suite 3.<br/>
				<ol>
					<li>Avant de proc&eacute;der &agrave; l'installation du logiciel, fermez toutes les applications, notamment les autres applications Adobe, Microsoft Office et les fen&ecirc;tres de navigateur.</li>
					<li>Proc&eacute;dez selon l'une des m&eacute;thodes suivantes&nbsp;:</li>
					<ul>
						<li>Ins&eacute;rez le CD ou le DVD dans le lecteur et suivez les instructions qui s'affichent. Si le programme d'installation ne d&eacute;marre pas automatiquement, veuillez lancer le processus d'installation en double-cliquant sur le fichier Setup.exe (Windows) ou Setup (Mac OS) au niveau de la racine de votre disque.</li>
						<li>Si vous avez t&eacute;l&eacute;charg&eacute; le logiciel depuis Internet, ouvrez le dossier et double-cliquez sur Setup.exe (Windows) ou Setup (Mac OS) puis suivez les instructions qui s'affichent &agrave; l'&eacute;cran.
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A3" id="A3"></a><h2>D&eacute;sinstallation du logiciel</h2>
			</div>
			<div id="description">
				<ol>
					<li>Avant de proc&eacute;der &agrave; la d&eacute;sinstallation du logiciel, fermez toutes les applications, notamment les autres applications Adobe, Microsoft Office et les fen&ecirc;tres de navigateur.</li>
					<li>Proc&eacute;dez selon l'une des m&eacute;thodes suivantes&nbsp;:</li>
					<ul>
						<li>Sous Windows, ouvrez le Panneau de configuration Windows et double-cliquez sur Ajout/suppression de programmes. S&eacute;lectionnez le produit que vous souhaitez d&eacute;sinstaller, cliquez sur Modifier/Supprimer puis suivez les instructions qui s'affichent &agrave; l'&eacute;cran.</li>
						<li>Sous Mac OS, double-cliquez sur le programme d'installation de produit sous Application\Utilitaires\Programme d'installation d'Adobe. Authentifiez-vous en tant qu'administrateur, s&eacute;lectionnez D&eacute;sinstaller les composants et suivez les instructions qui s'affichent.<br/>
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A6" id="A6"></a><h2>Installation de QuickTime</h2>
			</div>
			<div id="description">
				Pour utiliser la lecture vid&eacute;o dans Device Central, vous devez avoir install&eacute; sur votre syst&egrave;me Apple QuickTime Player version 7. Si vous n'installez pas QuickTime, vous ne pourrez pas visionner les vid&eacute;os, ni lire certains formats de sons contenus dans les documents Flash Lite. Pour installer QuickTime sur votre syst&egrave;me, rendez-vous sur le site de t&eacute;l&eacute;chargement Apple, <a href="http://www.apple.com/quicktime/download">http://www.apple.com/quicktime/download</a>, et suivez les instructions d'installation.
				
			</div>
			<div id="title">
				<a name="A7" id="A7"></a><h2>Emulation des polices</h2>
			</div>
			<div id="description">Afin d'&eacute;muler correctement les polices d&eacute;finies dans votre document Flash, assurez-vous que la police souhait&eacute;e est install&eacute;e sur votre syst&egrave;me. Si votre vid&eacute;o Flash utilise un des &laquo;&nbsp;types&nbsp;&raquo; de polices de p&eacute;riph&eacute;rique standard (_sans, _serif, _typewriter), Flash Lite le remplacera par la police correspondante disponible dans le syst&egrave;me. La plupart des polices d'origine des p&eacute;riph&eacute;riques &eacute;tant la propri&eacute;t&eacute; du fabricant, vous ne les trouverez peut-&ecirc;tre pas sur votre ordinateur. Vous trouverez dans les pr&eacute;f&eacute;rences de Device Central un mappage respectif des polices syst&egrave;mes courantes des syst&egrave;mes Windows et Mac pour les trois types de polices de p&eacute;riph&eacute;riques g&eacute;n&eacute;riques. Si vous disposez de la police de p&eacute;riph&eacute;rique du fabricant ou si vous souhaitez juste utiliser une autre police que la police par d&eacute;faut, allez dans les Pr&eacute;f&eacute;rences de Device Central et remappez les &laquo;&nbsp;types&nbsp;&raquo; de polices g&eacute;n&eacute;riques. Le mappage de polices est pris en charge dans diff&eacute;rentes langues. Vous ne pouvez mapper que les polices install&eacute;es sur votre syst&egrave;mes et qui sont conformes au codage langue s&eacute;lectionn&eacute;.
			</div>
			<div id="title">
				<a name="A8" id="A8"></a><h2>Probl&egrave;mes connus</h2>
			</div>
			<div id="description">
				<strong>Lecteur </strong>
				<ul>
					<li>Les lecteurs Flash Lite 1.1 et Flash Lite 2.x renvoient toujours &laquo;&nbsp;false&nbsp;&raquo; pour la fonctionnalit&eacute; <tt>_capStreamSound</tt>, ind&eacute;pendamment des informations sur le profil du p&eacute;riph&eacute;rique. </li>
					<li>Les lecteurs Flash Lite 2.x renvoient toujours &laquo;&nbsp;true&nbsp;&raquo; pour la propri&eacute;t&eacute; <tt>System.capabilities.hasStreamingAudio</tt>, ind&eacute;pendamment des informations sur le profil du p&eacute;riph&eacute;rique.  </li>
					<li>Les lecteurs  Flash Lite 2.x renvoient toujours &laquo;&nbsp;true&nbsp;&raquo; pour la fonctionnalit&eacute; syst&egrave;me <tt>hasQWERTYKeyboard</tt>, ind&eacute;pendamment des informations sur le profil du p&eacute;riph&eacute;rique. </li>
				</ul>
				<strong>Entr&eacute;e </strong>
				<ul>
					<li>Pour certains p&eacute;riph&eacute;riques, la fonctionnalit&eacute; <tt>mouseType</tt> peut ne pas &ecirc;tre &eacute;mul&eacute;e correctement si &lt;mouseType value=&quot;Partial&quot;/&gt;. Les &eacute;v&eacute;nements de souris pris en charge dans l'&eacute;mulateur ne sont donc par forc&eacute;ment identiques &agrave; ceux pris en charge sur le p&eacute;riph&eacute;rique actuel. V&eacute;rifiez toujours que les &eacute;v&eacute;nements de souris fonctionnent correctement sur le p&eacute;riph&eacute;rique r&eacute;el.</li>
					<li>La fonctionnalit&eacute; syst&egrave;me <tt>hasStylus</tt> renvoie &laquo;&nbsp;false&nbsp;&raquo; si &lt;mouseType value=&quot;Stylus&quot;/&gt;.</li>
					<li>Device Central ne v&eacute;rifie pas que le fichier test&eacute; est conforme aux conventions strictes de d&eacute;nomination de fichiers p&eacute;riph&eacute;riques BREW. Si vous souhaitez cibler des p&eacute;riph&eacute;riques BREW, assurez-vous que votre fichier est conforme aux r&egrave;gles BREW.</li>
				</ul>
				<strong>Videos et images incluses dans un fichier SWF</strong> <br/>Les vid&eacute;os et images incluses dans un fichier SWF passent toujours dans l'&eacute;mulateur, que le p&eacute;riph&eacute;rique prenne cette fonction en charge ou non. Pour v&eacute;rifier la prise en charge de vid&eacute;os et images dans un fichier SWF, s&eacute;lectionnez le ou les p&eacute;riph&eacute;riques cibles, cliquez sur l'onglet Profils de p&eacute;riph&eacute;rique et allez dans la section Flash. Si les vid&eacute;os et images d'un fichier SWF sont prises en charge, vous verrez une liste des formats respectifs. <br/><br/><strong>Contenu SWF int&eacute;gr&eacute; dans les pages Web</strong> <br/>Sous Windows, l'&eacute;mulateur ne lit pas le contenu Flash int&eacute;gr&eacute; dans les pages Web. Sous Mac, Device Central utilise le module de bureau Flash qui peut donner des r&eacute;sultats inattendus avec un contenu Flash Lite. <br/> <br/>Nous vous conseillons de tester s&eacute;par&eacute;ment les contenus Flash Lite int&eacute;gr&eacute;s. <br/><br/><strong>Son</strong>
				<ul>
					<li>Les formats sons propres &agrave; BREW, tels que QCELP, CMX et BCI ne sont pas lus.</li>
					<li>La fonctionnalit&eacute; <tt>soundChannels</tt> est toujours &laquo;&nbsp;Stereo&nbsp;&raquo;, m&ecirc;me si les profils de p&eacute;riph&eacute;riques indiquent uniquement une prise en charge des sons monos.</li>
					<li>Le lecteur Flash Lite 1.1 renvoie toujours &laquo;&nbsp;Yes&nbsp;&raquo; pour la fonctionnalit&eacute; <tt>multipleDeviceSounds</tt>, m&ecirc;me si le profil de p&eacute;riph&eacute;rique indique que le m&eacute;lange de sons n'est pas pris en charge.</li>
					<li>Les vid&eacute;os SWF avec plusieurs sons bruts PCM natifs int&eacute;gr&eacute;s pour une lecture simultan&eacute;e (m&eacute;lange) peuvent pr&eacute;senter quelques probl&egrave;mes de qualit&eacute; &agrave; la lecture sur les lecteurs Flash Lite 2.x.</li>
					<li>Vous risquez de rencontrer des probl&egrave;mes de qualit&eacute; lors de la lecture de fichiers MIDI. Pour une meilleure qualit&eacute;, allez dans les param&egrave;tres syst&egrave;me de QuickTime et essayez de modifier le synth&eacute;tiseur par d&eacute;faut en MIDI.</li>
					<li>Sous Mac, il se peut que des parties de sons ne soient pas lues au d&eacute;but.</li>
					<li>Sous Mac, vous risquez de rencontrer des probl&egrave;mes de qualit&eacute; lors de la lecture de fichiers natifs MP3, MFI et MIDI sur les lecteurs Flash Lite 2.x.</li>
					<li>Sur les ordinateurs Mac Power, les fichiers SMAF-5 risquent de sauter et de s'interrompre lors de la lecture.</li>
					<li>Le son risque de sauter lorsque vous faites glisser la souris rapidement dans la fen&ecirc;tre de l'application. </li>
				</ul>
				<strong>Performance</strong> <br/>Chaque p&eacute;riph&eacute;rique dispose d'informations sur l'indice de performance, d&eacute;termin&eacute; au cours d'un test de performance effectu&eacute; par Adobe sur le p&eacute;riph&eacute;rique r&eacute;el. Cet indice de performance permet de classer les p&eacute;riph&eacute;riques. Plus il est &eacute;lev&eacute;, plus le p&eacute;riph&eacute;rique est performant. Avant de pouvoir simuler la performance du p&eacute;riph&eacute;rique sur votre ordinateur, vous devez ex&eacute;cuter un processus de calibration. Au cours de ce processus, Device Central ex&eacute;cute le fichier SWF utilis&eacute; au cours du test de performance sur le p&eacute;riph&eacute;rique r&eacute;el. Le r&eacute;sultat de la calibration effectu&eacute;e sur votre ordinateur est ensuite compar&eacute; &agrave; l'indice de performance du p&eacute;riph&eacute;rique. <br/> <br/><i>Remarque&nbsp;: la simulation de performance est une approximation de la v&eacute;ritable performance du p&eacute;riph&eacute;rique.<br/></i><br/> Le fichier SWF utilis&eacute; pour la calibration contient du texte, des bitmaps et des interpolations vectorielles. La simulation de performance sera donc plus pr&eacute;cise pour ce type de contenu. Les fonctionnalit&eacute;s telles que l'analyse XML, ActionScript et la mise en r&eacute;seau, ne sont pas prises en compte pour ce test de performance. <br/> <br/>Pour obtenir des r&eacute;sultats de simulation plus pr&eacute;cis, calibrez fr&eacute;quemment votre p&eacute;riph&eacute;rique car d'autres processus s'ex&eacute;cutant sur votre ordinateur affectent les performances. Vous devez toujours effectuer le test final sur le p&eacute;riph&eacute;rique r&eacute;el.<br/> <br/><strong>Commandes FSCommand2&nbsp;</strong><br/>SetFullScreen&nbsp;: Chaque fichier SWF est &eacute;mul&eacute; comme s'il &eacute;tait en Plein &eacute;cran.<br/>
				
				<br/>SetInputTextType&nbsp;: L'&eacute;mulateur ignore les restrictions de saisie de texte en caract&egrave;res latin/non latin.<br/> <br/>
				
				Lorsqu'elles sont prises en charge, les commandes FSCommand2 suivantes sont &eacute;mul&eacute;es, m&ecirc;me si le profil de p&eacute;riph&eacute;rique fournit d'autres informations.<br/>
				
				<br/>Tous les lecteurs Flash Lite&nbsp;: 
				
				<ul>
					<li>Escape, Unescape&nbsp;</li>
					<li>GetFreePlayerMemory, GetTotalPlayerMemory</li>
					<li>GetTimezoneOffset&nbsp;<br/>
					</li>
				</ul>
				Lecteurs Flash Lite 2.x&nbsp;:
				
				<ul>
					<li>GetDateDay, GetDateMonth, GetDateWeekday, GetDateYear</li>
					<li>GetTimeHour, GetTimeMinute, GetTimeSecond
					</li>
				</ul>
			</div>
			<div id="title">
				<a name="A9" id="A9"></a><h2>Assistance client&egrave;le</h2>
			</div>
			<div id="description">
				<strong>Assistance client&egrave;le</strong><br/> L'assistance client&egrave;le Adobe propose des informations sur le produit, une aide pour les ventes, l'enregistrement et pour d'autres probl&egrave;mes non techniques. Pour contacter l'assistance client&egrave;le Adobe, allez sur la page principale Adobe.com correspondant &agrave; votre r&eacute;gion ou votre pays. Cliquez alors sur Contact.<br/> <br/> <strong>Options du plan d'assistance et ressources techniques</strong><br/> Vous trouverez toutes les informations sur l'assistance technique pour votre produit, notamment pour obtenir des informations sur les options d'assistance gratuites et payantes et sur les ressources de d&eacute;pannage, &agrave; la page <a href="http://www.adobe.com/go/support_fr/">http://www.adobe.com/go/support_fr/</a>. En dehors des Etats-Unis, consultez la page <a href="http://www.adobe.com/go/intlsupport_fr/">http://www.adobe.com/go/intlsupport_fr/</a>. Les ressources de d&eacute;pannage gratuites comprennent notamment une base de connaissance d'assistance Adobe, des forums d'utilisateurs Adobe, etc.</div>
			<div id="title">
				<a name="A10" id="A10"></a><h2>Autres ressources</h2>
			</div>
			<div id="description">
				<strong>Documentation</strong> <br/>Commandez les documents sur papier &agrave; l'adresse suivante&nbsp;: <a href="http://www.adobe.com/go/buy_books_fr">www.adobe.com/go/buy_books_fr</a>.<br/> <br/> <strong>Ressources en ligne</strong> <br/>P&ocirc;le de d&eacute;veloppement T&eacute;l&eacute;phone et terminaux mobiles sur <a href="http://www.adobe.com/go/mobiledeveloper_fr">www.adobe.com/go/mobiledeveloper_fr</a>.<a href="http://www.adobe.com/go/mobiledeveloper_fr"><br/></a>P&ocirc;le de d&eacute;veloppement sur <a href="http://www.adobe.com/go/developer_fr">www.adobe.com/go/developer_fr</a>.</div>
			<div id="title">
				<a name="A11" id="A11"></a><h2>Informations juridiques</h2>
			</div>
			<div id="description">
				Les images de périphériques mobiles sont fournies avec ce logiciel uniquement à des fins de simulation et ne seront peut-être pas implémentées dans la technologie Adobe lorsqu'elle sera commercialisée par le fabricant du périphérique correspondant.<br/>
				<br/> Informations mises &agrave; jour/Informations sur le code de tiers Adobe disponible sur la page <a href="http://www.adobe.com/go/thirdparty_fr/">www.adobe.com/go/thirdparty_fr</a>.</div>
		</div>
	
</body>

</html>
	  
	