<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"> 

<html>

	<head>
	
		<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
		<meta name="title" content="Adobe Read Me File" />
		<meta name="description" content= "Adobe products provide ... " />
		<title>Adobe Device Central &quot;Bitte lesen&quot; </title>
		<style type="text/css" media="screen">

/***********************  fonts  ************************/		
	body 
    {font-family: Arial, Verdana, Helvetica, sans-serif;
	 font-weight: normal;
	 font-size: 10pt;
	 color: #000000;
     margin: 0px;
	 background-color: white;}
	
	h1
	{display:inline;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: normal;
	color: #999999;}
	
	h2 
	{display:inline;
	font-size: 10pt;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: bold;
	color: #666666;}


/***********************  links  ************************/		
	
	a:link 
	{color:#004477;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:visited
	{color:#6d7f8e;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:hover 
	{color:#ff0000;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}

/***********************  div tags  ************************/		
	#page
	{float:left;
	width:700px;
	margin:20px 20px 20px 20px;}
	
	#subTitle
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#title
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#description
	{float:left;
	width:700px;
	padding:15px 0px 15px 0px;}


</style>
		
	</head>
	
<body>
	
<div id="page">
	<h1><span style="font-size:20pt">Adobe<sup>&reg;</sup></span></h1><br/>
			<div id="subTitle 1">
				<h1><span style="font-size:16pt">Device Central CS3 &quot;Bitte lesen&quot;</span></h1>
				<br/>
			</div>
			<div id="description">Willkommen bei Adobe&reg; Device Central CS3. Dieses Dokument liefert neueste Produktinformationen, Aktualisierungen und Tipps zur Fehlerbehebung, die nicht in der Produktdokumentation enthalten sind.<br/> <br/> <a href="#A1">Systemanforderungen</a><br/> <a href="#A2">Software installieren</a><br/> <a href="#A3">Software deinstallieren</a><br/> <a href="#A6">QuickTime-Installation </a><br/> <a href="#A7">Schriftartenemulation</a><br/> <a href="#A8">Bekannte Probleme</a><br/> <a href="#A9">Kundenunterst&uuml;tzung</a><br/> <a href="#A10">Weitere Ressourcen</a><br/> <a href="#A11">Rechtliche Hinweise </a>
			</div>
			<div id="title">
				<a name="A1" id="A1"></a><h2>Systemanforderungen</h2>
			</div>
			<div id="description">
				Device Central kann nur als Komponente eines Adobe&reg; CS3-Produkts oder mit Adobe&reg; Creative Suite 3 installiert werden. Deshalb m&uuml;ssen Sie die Systemanforderungen des jeweiligen Adobe-Produkts beachten, mit dem Sie Device Central installieren.
				
			</div>
			<div id="title">
				<a name="A2" id="A2"></a><h2>Software installieren</h2>
			</div>
			<div id="description">Device Central kann nur als Komponente eines Adobe&reg; CS3-Produkts oder von Adobe&reg; Creative Suite 3 installiert werden.<br/>
				<ol>
					<li>Vor der Installation m&uuml;ssen Sie alle derzeit in Ihrem System ausgef&uuml;hrten Anwendungen schlie&szlig;en, einschlie&szlig;lich anderer Adobe-Anwendungen, Microsoft Office-Anwendungen und Browserfenster.</li>
					<li>F&uuml;hren Sie einen der folgenden Schritte durch:</li>
					<ul>
						<li>Legen Sie die CD oder DVD in das Laufwerk ein und befolgen Sie die Anweisungen auf dem Bildschirm. (Wenn das Installationsprogramm nicht automatisch gestartet wird, doppelklicken Sie auf der Stammebene Ihres Datentr&auml;gers auf die Datei Setup.exe (Windows) oder Setup (Mac OS), um den Installationsvorgang zu starten.)</li>
						<li>Wenn Sie die Software aus dem Internet heruntergeladen haben, &ouml;ffnen Sie den Ordner, doppelklicken Sie auf die Datei Setup.exe (Windows) oder Setup (Mac OS) und befolgen Sie die Anweisungen auf dem Bildschirm.
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A3" id="A3"></a><h2>Software deinstallieren</h2>
			</div>
			<div id="description">
				<ol>
					<li>Vor der Deinstallation m&uuml;ssen Sie alle derzeit in Ihrem System ausgef&uuml;hrten Anwendungen schlie&szlig;en, einschlie&szlig;lich anderer Adobe-Anwendungen, Microsoft Office-Anwendungen und Browserfenster.</li>
					<li>F&uuml;hren Sie einen der folgenden Schritte durch:</li>
					<ul>
						<li>Unter Windows &ouml;ffnen Sie die Windows-Systemsteuerung und doppelklicken anschlie&szlig;end auf &quot;Software&quot;. W&auml;hlen Sie das zu deinstallierende Produkt aus, klicken Sie auf &quot;&Auml;ndern/Entfernen&quot; und befolgen Sie die Anweisungen auf dem Bildschirm.</li>
						<li>Unter Mac OS doppelklicken Sie auf das Produktinstallationsprogramm unter &quot;Anwendungen\Dienstprogramme\Adobe-Installationsprogramme&quot;. Authentifizieren Sie sich als Administrator, w&auml;hlen Sie &quot;Komponenten deinstallieren&quot; und folgen Sie den Anweisungen auf dem Bildschirm.<br/>
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A6" id="A6"></a><h2>QuickTime-Installation</h2>
			</div>
			<div id="description">
				F&uuml;r die Videowiedergabe in Device Central muss der Apple QuickTime Player Version&nbsp;7 oder h&ouml;her in Ihrem System installiert sein. Wenn Sie QuickTime nicht installieren, k&ouml;nnen Sie kein Video und auch bestimmte Soundformate nicht wiedergeben, die in Ihren Flash Lite-Dokumenten enthalten sind. Um QuickTime in Ihrem System zu installieren, wechseln Sie zur Apple-Download-Seite unter <a href="http://www.apple.com/quicktime/download">http://www.apple.com/quicktime/download</a> und befolgen die Installationsanweisungen.
				
			</div>
			<div id="title">
				<a name="A7" id="A7"></a><h2>Schriftartenemulation</h2>
			</div>
			<div id="description">Um in Ihrem Flash-Dokument definierte Schriftarten korrekt zu emulieren, m&uuml;ssen Sie sicherstellen, dass die gew&uuml;nschte Schriftart in Ihrem System installiert ist. Wenn Ihr Flash-Film eine der generischen Flash-Ger&auml;teschriftarten (_sans, _serif, _typewriter) verwendet, ersetzt Flash Lite diese durch eine entsprechende im System verf&uuml;gbare Schriftart. Die meisten systemeigenen Schriftarten auf Ger&auml;ten sind Eigentum des Herstellers und daher m&ouml;glicherweise nicht auf Ihrem Computer verf&uuml;gbar. Die Voreinstellungen von Device Central bieten eine Zuordnung der &uuml;blichen Windows- und Mac OS-Systemschriftarten f&uuml;r die drei generischen Ger&auml;teschriftarten. Wenn bei Ihnen die tats&auml;chliche Ger&auml;teschriftart eines Herstellers installiert ist oder Sie einfach eine andere Schriftart als Standard verwenden m&ouml;chten, gehen Sie in Device Central zu den Voreinstellungen und ordnen die generischen Schriftarten wie gew&uuml;nscht neu zu. Die Schriftartzuordnung wird f&uuml;r verschiedene Sprachen unterst&uuml;tzt. Sie k&ouml;nnen nur Schriftarten zuordnen, die in Ihrem System installiert sind und mit der Kodierung der ausgew&auml;hlten Schriftart &uuml;bereinstimmen.
			</div>
			<div id="title">
				<a name="A8" id="A8"></a><h2>Bekannte Probleme</h2>
			</div>
			<div id="description">
				<strong>Player </strong>
				<ul>
					<li>Flash Lite 1.1- und Flash Lite 2.x-Player geben f&uuml;r die Funktion <tt>_capStreamSound</tt> immer &quot;falsch&quot; zur&uuml;ck, und zwar unabh&auml;ngig von den Ger&auml;teprofilinformationen. </li>
					<li>Flash Lite 2.x-Player geben unabh&auml;ngig von den Ger&auml;teprofilinformationen f&uuml;r die Eigenschaft <tt>System.capabilities.hasStreamingAudio</tt> immer &quot;wahr&quot; zur&uuml;ck.  </li>
					<li>Flash Lite 2.x-Player geben unabh&auml;ngig von den Ger&auml;teprofilinformationen f&uuml;r die Systemfunktion <tt>hasQWERTYKeyboard</tt> immer &quot;wahr&quot; zur&uuml;ck. </li>
				</ul>
				<strong>Eingabe </strong>
				<ul>
					<li>F&uuml;r bestimmte Ger&auml;te wird die Funktion <tt>mouseType</tt> m&ouml;glicherweise nicht korrekt emuliert, wenn &lt;mouseType value=&quot;Partial&quot;/&gt; gilt. Das bedeutet, dass sich die unterst&uuml;tzten Mausereignisse im Emulator m&ouml;glicherweise von den auf einem tats&auml;chlichen Ger&auml;t unterst&uuml;tzten Mausereignissen unterscheiden. &Uuml;berpr&uuml;fen Sie immer, ob die Mausereignisse auf dem tats&auml;chlichen Ger&auml;t wie erwartet funktionieren.</li>
					<li>Die Systemfunktion <tt>hasStylus</tt> gibt &quot;falsch&quot; zur&uuml;ck, wenn &lt;mouseType value=&quot;Stylus&quot;/&gt; gilt.</li>
					<li>Device Central &uuml;berpr&uuml;ft nicht, ob die getestete Datei die strengen Dateinamenkonventionen von BREW-Ger&auml;ten erf&uuml;llt. Wenn Ihre Zielger&auml;te BREW-Ger&auml;te sind, stellen Sie sicher, dass Ihre Datei den BREW-Regeln entspricht.</li>
				</ul>
				<strong>In einer SWF-Datei enthaltene Videos &amp; Bilder</strong><br/> Videos und Bilder, die in einer SWF-Datei enthalten sind, werden immer im Emulator wiedergegeben, und zwar unabh&auml;ngig davon, ob dies auf dem tats&auml;chlichen Ger&auml;t unterst&uuml;tzt wird. Um die Unterst&uuml;tzung von Video und Bildern in einer SWF zu pr&uuml;fen, w&auml;hlen Sie die gew&uuml;nschten Zielger&auml;te aus, klicken auf die Registerkarte &quot;Ger&auml;teprofile&quot; und gehen zum Abschnitt &quot;Flash&quot;. Wenn in einer SWF-Datei Video und Bilder unterst&uuml;tzt sind, werden die entsprechenden Formate aufgelistet. <br/><br/><strong>Auf Webseiten enthaltene SWF-Inhalte</strong> <br/>Unter Windows gibt der Emulator keine in Webseiten eingebettete Flash-Inhalte wieder. Unter Mac OS verwendet Device Central das Flash-Desktop-Plug-In, das m&ouml;glicherweise zu unerw&uuml;nschten Ergebnissen mit Flash Lite-Inhalten f&uuml;hrt. <br/> <br/>Wir empfehlen, eingebettete Flash Lite-Inhalte getrennt zu testen. <br/><br/><strong>Audio</strong>
				<ul>
					<li>BREW-spezifische Soundformate wie zum Beispiel QCELP, CMX und BCI werden nicht wiedergegeben.</li>
					<li>Die Funktion <tt>soundChannels</tt> wird immer als &quot;Stereo&quot; zur&uuml;ckgegeben, unabh&auml;ngig davon, ob die Ger&auml;teprofile nur Unterst&uuml;tzung f&uuml;r Monosounds anzeigen.</li>
					<li>Der Flash Lite 1.1-Player gibt f&uuml;r die Funktion <tt>multipleDeviceSounds</tt> immer &quot;Ja&quot; zur&uuml;ck, selbst wenn die Ger&auml;teprofile anzeigen, dass ein Mixing mehrerer Sounds nicht unterst&uuml;tzt wird.</li>
					<li>SWF-Filme mit mehreren systemeigenen PCM-Raw-Sounds, die so eingebettet sind, dass sie gleichzeitig abgespielt werden (Mixing), verursachen auf Flash Lite 2.x-Playern m&ouml;glicherweise Probleme mit der Wiedergabequalit&auml;t.</li>
					<li>Bei der Wiedergabe von MIDI-Dateien treten m&ouml;glicherweise Qualit&auml;tsprobleme auf. Versuchen Sie, in den QuickTime-Systemeinstellungen als Standardsynthesizer &quot;General MIDI&quot; einzustellen, um die Qualit&auml;t zu verbessern.</li>
					<li>Unter Mac OS kann es vorkommen, dass kleine Soundteile am Anfang &uuml;bersprungen werden.</li>
					<li>Unter Mac OS treten mit Flash Lite&nbsp;2x-Playern m&ouml;glicherweise Qualit&auml;tsprobleme auf, wenn systemeigene MP3-, MFI- und MIDI-Formate wiedergegeben werden.</li>
					<li>Auf Mac Power-PCs werden SMAF-5-Dateien m&ouml;glicherweise &uuml;bersprungen und bei der Wiedergabe ausgelassen.</li>
					<li>Bei der Soundwiedergabe kann ein Stottern auftreten, wenn das Anwendungsfenster schnell mit der Maus auf dem Bildschirm hin- und hergezogen wird. </li>
				</ul>
				<strong>Leistung</strong> <br/>Zu jedem Ger&auml;teprofil geh&ouml;ren Leistungsindexinformationen als Ergebnis eines Leistungstests, den Adobe auf dem tats&auml;chlichen Ger&auml;t durchgef&uuml;hrt hat. Dieser Leistungsindex erm&ouml;glicht eine Kategorisierung der Ger&auml;te. Je h&ouml;her der Index ist, desto besser ist die Leistung. Um die Ger&auml;teleistung auf Ihrem Computer zu simulieren, m&uuml;ssen Sie zuerst eine Kalibrierung durchf&uuml;hren. Bei dieser Kalibrierung f&uuml;hrt Device Central dieselbe SWF-Datei aus, die beim Leistungstest auf dem tats&auml;chlichen Ger&auml;t verwendet wurde. Das Ergebnis der Kalibrierung auf Ihrem Computer wird anschlie&szlig;end in Relation zum Leistungsindex des Ger&auml;ts gesetzt. <br/> <br/><i>Hinweis: Die Leistungssimulation ist eine Ann&auml;herung an die tats&auml;chliche Ger&auml;teleistung.<br/></i><br/> Die f&uuml;r die Kalibrierung verwendete SWF-Datei enth&auml;lt Text-, Bitmap- und Vektor-Tweens. Daher ist die Leistungssimulation f&uuml;r diese Inhaltstypen sehr pr&auml;zise. Funktionen wie XML-Parsing, ActionScript und Networking wurden in diesem Leistungstest nicht ber&uuml;cksichtigt. <br/> <br/> Um genaue Simulationsergebnisse zu erhalten, f&uuml;hren Sie die Ger&auml;tekalibrierung regelm&auml;&szlig;ig durch, da andere auf Ihrem Computer ausgef&uuml;hrte Prozesse die Leistung beeinflussen. Die abschlie&szlig;enden Tests m&uuml;ssen immer auf dem tats&auml;chlichen Ger&auml;t durchgef&uuml;hrt werden.<br/> <br/><strong>FSCommand2-Befehle </strong><br/> SetFullScreen: Jede SWF-Datei wird entsprechend dem Vollbildmodus emuliert.<br/>
				
				<br/>SetInputTextType: Der Emulator ignoriert Texteingabebeschr&auml;nkungen in Bezug auf lateinische bzw. nicht lateinische Zeichen.<br/> <br/>
				
				Die folgenden FSCommand2-Befehle werden so emuliert, als w&uuml;rden sie unterst&uuml;tzt, selbst wenn das Ger&auml;teprofil abweichende Informationen enth&auml;lt.<br/>
				
				<br/>Alle Flash Lite-Player: 
				
				<ul>
					<li>Escape, Unescape&nbsp;</li>
					<li>GetFreePlayerMemory, GetTotalPlayerMemory</li>
					<li>GetTimezoneOffset&nbsp;<br/>
					</li>
				</ul>
				Flash Lite&nbsp;2.x-Player:
				
				<ul>
					<li>GetDateDay, GetDateMonth, GetDateWeekday, GetDateYear</li>
					<li>GetTimeHour, GetTimeMinute, GetTimeSecond
					</li>
				</ul>
			</div>
			<div id="title">
				<a name="A9" id="A9"></a><h2>Kundenunterst&uuml;tzung</h2>
			</div>
			<div id="description">
				<strong>Kundenservice</strong><br/> Der Adobe-Kundenservice liefert Produktinformationen und bietet Unterst&uuml;tzung bei Verkauf, Registrierung und anderen nicht technischen Problemen. Kontaktinformationen zum Adobe-Kundenservice finden Sie auf der Adobe.com-Hauptseite f&uuml;r Ihre Region bzw. Ihr Land, indem Sie auf &quot;Kontakt&quot; klicken.<br/> <br/> <strong>Supportplanoptionen und technische Ressourcen</strong><br/> Wenn Sie technische Unterst&uuml;tzung f&uuml;r Ihr Produkt einschlie&szlig;lich Informationen zu kostenlosen und geb&uuml;hrenpflichtigen Supportoptionen und Fehlerbehebungsressourcen ben&ouml;tigen, finden Sie weitere Informationen unter <a href="http://www.adobe.com/go/support_de/">http://www.adobe.com/go/support_de/</a>. Au&szlig;erhalb von Nordamerika gilt die Adresse <a href="http://www.adobe.com/go/intlsupport_de/">http://www.adobe.com/go/intlsupport_de/</a>. Zu den kostenlosen Fehlerbehebungsressourcen z&auml;hlen die Knowledge Base des Adobe-Support, Adobe-Anwenderforen und vieles mehr.</div>
			<div id="title">
				<a name="A10" id="A10"></a><h2>Weitere Ressourcen</h2>
			</div>
			<div id="description">
				<strong>Dokumentation</strong><br/> Gedruckte Dokumentation k&ouml;nnen Sie unter <a href="http://www.adobe.com/go/buy_books_de">www.adobe.com/go/buy_books_de</a> bestellen.<br/> <br/> <strong>Online-Ressourcen</strong><br/>Mobile and Devices Developer Center unter <a href="http://www.adobe.com/go/mobiledeveloper_de">www.adobe.com/go/mobiledeveloper_de</a>.<a href="http://www.adobe.com/go/mobiledeveloper_de"><br/></a>Developer Center unter <a href="http://www.adobe.com/go/developer_de">www.adobe.com/go/developer_de</a>.</div>
			<div id="title">
				<a name="A11" id="A11"></a><h2>Rechtliche Hinweise</h2>
			</div>
			<div id="description">
				Die mit der Softwareanwendung oder Benutzerdokumentation angezeigten Bilder werden nur zu Simulationszwecken zur Verfügung gestellt, wobei die Geräte bei der kommerziellen Auslieferung durch den entsprechenden Gerätehersteller möglicherweise nicht mit Adobe-Technologie ausgerüstet sind.<br/>
				<br/> Aktuelle Informationen bzw. Informationen zu Drittanbietercodes finden Sie unter <a href="http://www.adobe.com/go/thirdparty_de/">www.adobe.com/go/thirdparty_de</a>.</div>
		</div>
	
</body>

</html>
	  
	