<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"> 

<html>

	<head>
	
		<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
		<meta name="title" content="Adobe Read Me File" />
		<meta name="description" content= "Adobe products provide ... " />
		<title>L&eacute;ame de Adobe Device Central </title>
		<style type="text/css" media="screen">

/***********************  fonts  ************************/		
	body 
    {font-family: Arial, Verdana, Helvetica, sans-serif;
	 font-weight: normal;
	 font-size: 10pt;
	 color: #000000;
     margin: 0px;
	 background-color: white;}
	
	h1
	{display:inline;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: normal;
	color: #999999;}
	
	h2 
	{display:inline;
	font-size: 10pt;
	font-family: Arial, Verdana, Helvetica, sans-serif;
	font-weight: bold;
	color: #666666;}


/***********************  links  ************************/		
	
	a:link 
	{color:#004477;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:visited
	{color:#6d7f8e;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}
	
	a:hover 
	{color:#ff0000;
	text-decoration:none;
	margin: 0px 0px 0px 0px;}

/***********************  div tags  ************************/		
	#page
	{float:left;
	width:700px;
	margin:20px 20px 20px 20px;}
	
	#subTitle
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#title
	{background-color:#e3e3e3;
	float:left;
	width:700px;
	border-bottom:solid #999999 1.0pt;
	border-bottom-alt:solid #999999 .5pt;
	padding:2px 0px 4px 0px;}
	
	#description
	{float:left;
	width:700px;
	padding:15px 0px 15px 0px;}


</style>
		
	</head>
	
<body>
	
<div id="page">
	<h1><span style="font-size:20pt">Adobe<sup>&reg;</sup></span></h1><br/>
			<div id="subTitle 1">
				<h1><span style="font-size:16pt">L&eacute;ame de Device Central CS3 </span></h1>
				<br/>
			</div>
			<div id="description">Bienvenido a Adobe&reg; Device Central CS3. Este documento contiene la informaci&oacute;n m&aacute;s actualizada sobre el producto, as&iacute; como sugerencias para resoluci&oacute;n de problemas y actualizaciones que no se incluyen en la documentaci&oacute;n del producto.<br/> <br/> <a href="#A1">Requisitos m&iacute;nimos del sistema</a><br/> <a href="#A2">Instalar el software</a><br/> <a href="#A3">Desinstalar el software</a><br/> <a href="#A6">Instalaci&oacute;n de QuickTime</a><br/> <a href="#A7">Emulaci&oacute;n de fuentes</a><br/> <a href="#A8">Problemas conocidos</a><br/> <a href="#A9">Servicio de atenci&oacute;n al cliente</a><br/> <a href="#A10">Otros recursos</a><br/> <a href="#A11">Avisos legales</a>
			</div>
			<div id="title">
				<a name="A1" id="A1"></a><h2>Requisitos m&iacute;nimos del sistema</h2>
			</div>
			<div id="description">
				Device Central s&oacute;lo se puede instalar como un componente del producto Adobe&reg; CS3 o con Adobe&reg; Creative Suite 3. Por esta raz&oacute;n, se deben consultar los requisitos del sistema para cualquier producto de Adobe con el que se vaya a instalar Device Central.
				
			</div>
			<div id="title">
				<a name="A2" id="A2"></a><h2>Instalar el software</h2>
			</div>
			<div id="description">Device Central s&oacute;lo se puede instalar como un componente de un producto Adobe&reg; CS3 o con Adobe&reg; Creative Suite 3.<br/>
				<ol>
					<li>Antes de realizar la instalaci&oacute;n, cierre todas las aplicaciones que se est&eacute;n ejecutando en el sistema, incluidas las ventanas del explorador, las aplicaciones de Microsoft Office y otras aplicaciones de Adobe.</li>
					<li>Realice una de las siguientes acciones:</li>
					<ul>
						<li>Inserte el CD o el DVD en la unidad correspondiente y siga las instrucciones que aparecen en pantalla. Si el programa de instalaci&oacute;n no se inicia autom&aacute;ticamente, haga doble clic en el archivo Setup.exe (Windows) o Setup (Mac OS) que se encuentra en el nivel de ra&iacute;z del disco para iniciar el proceso de instalaci&oacute;n.</li>
						<li>Si ha descargado el software de Internet, abra la carpeta y haga doble clic en Setup.exe (Windows) o Setup (Mac OS) y, a continuaci&oacute;n, siga las instrucciones que aparecen en pantalla.
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A3" id="A3"></a><h2>Desinstalar el software</h2>
			</div>
			<div id="description">
				<ol>
					<li>Antes de realizar la desinstalaci&oacute;n, cierre todas las aplicaciones que se est&eacute;n ejecutando en el sistema, incluidas las ventanas del explorador, las aplicaciones de Microsoft Office y otras aplicaciones de Adobe.</li>
					<li>Realice una de las siguientes acciones:</li>
					<ul>
						<li>En Windows, abra el Panel de control y haga doble clic en Agregar o quitar programas. Seleccione el producto que desee desinstalar, haga clic en Cambiar o quitar y, a continuaci&oacute;n, siga las instrucciones que aparecen en pantalla.</li>
						<li>En Mac OS, haga doble clic en el archivo de instalaci&oacute;n del producto que se encuentra en Aplicaciones\Utilidades\Adobe Installers. Autent&iacute;quese como administrador, seleccione la opci&oacute;n de desinstalaci&oacute;n de componentes y, a continuaci&oacute;n, siga las instrucciones que aparecen en pantalla.<br/>
						</li>
					</ul>
				</ol>
			</div>
			<div id="title">
				<a name="A6" id="A6"></a><h2>Instalaci&oacute;n de QuickTime </h2>
			</div>
			<div id="description">
				Para reproducir v&iacute;deo en Device Central, es necesario tener instalado Apple QuickTime Player versi&oacute;n 7 o posterior en el sistema. Si no instala QuickTime, no podr&aacute; reproducir v&iacute;deo ni determinados formatos de sonido incluidos en los documentos de Flash Lite. Para instalar QuickTime en el sistema, acceda al sitio de descargas de Apple que se encuentra en la direcci&oacute;n <a href="http://www.apple.com/quicktime/download">http://www.apple.com/quicktime/download</a> y siga las instrucciones de instalaci&oacute;n.
				
			</div>
			<div id="title">
				<a name="A7" id="A7"></a><h2>Emulaci&oacute;n de fuentes</h2>
			</div>
			<div id="description">Para conseguir una emulaci&oacute;n precisa de las fuentes definidas en los documentos de Flash, deber&aacute; asegurarse de tener instaladas en el sistema las fuentes correspondientes. Si una pel&iacute;cula de Flash utiliza uno de los &quot;tipos&quot; de fuentes de dispositivo gen&eacute;ricas de Flash (_sans, _serif, _typewriter), Flash Lite lo sustituir&aacute; por una fuente equivalente disponible en el sistema. La mayor&iacute;a de las fuentes nativas de los dispositivos son propiedad del fabricante, por lo que es posible que no est&eacute;n disponibles en el equipo. El men&uacute; Preferencias de Device Central proporciona una asignaci&oacute;n de fuentes comunes de los sistemas Windows y Mac OS para los tres tipos de fuentes de dispositivo gen&eacute;ricas. Si tiene instalada la fuente de dispositivo real de un fabricante o simplemente desea utilizar una fuente distinta como fuente predeterminada, acceda al men&uacute; Preferencias de Device Central y reasigne los &quot;tipos&quot; de fuentes gen&eacute;ricas como desee. Es posible realizar la asignaci&oacute;n de fuentes con distintos idiomas. S&oacute;lo se pueden asignar fuentes que est&eacute;n instaladas en el sistema y que sean compatibles con la codificaci&oacute;n del idioma seleccionado.
			</div>
			<div id="title">
				<a name="A8" id="A8"></a><h2>Problemas conocidos</h2>
			</div>
			<div id="description">
				<strong>Reproductor </strong>
				<ul>
					<li>En los reproductores Flash Lite 1.1 y Flash Lite 2.x siempre se establece la opci&oacute;n &quot;false&quot; (falso) para la funci&oacute;n <tt>_capStreamSound</tt>, independientemente de cu&aacute;l sea la informaci&oacute;n del perfil de dispositivo. </li>
					<li>En los reproductores Flash Lite 2.x siempre se establece la opci&oacute;n &quot;true&quot; (verdadero) para la propiedad <tt>System.capabilities.hasStreamingAudio</tt>, independientemente de cu&aacute;l sea la informaci&oacute;n del perfil de dispositivo.  </li>
					<li>En los reproductores Flash Lite 2.x siempre se establece la opci&oacute;n &quot;true&quot; (verdadero) para la funci&oacute;n del sistema <tt>hasQWERTYKeyboard</tt>, independientemente de cu&aacute;l sea la informaci&oacute;n del perfil de dispositivo. </li>
				</ul>
				<strong>Entrada </strong>
				<ul>
					<li>Es posible que la funci&oacute;n <tt>mouseType</tt> no se pueda emular correctamente para algunos dispositivos si el valor de tipo de rat&oacute;n es &quot;Parcial&quot; (&lt;mouseType=&quot;Partial&quot;/&gt;). Esto significa que los eventos de rat&oacute;n admitidos en el emulador pueden ser distintos de los admitidos en un dispositivo real. Compruebe siempre que los eventos de rat&oacute;n funcionen tal como se espera en el dispositivo real.</li>
					<li>Para la funci&oacute;n del sistema <tt>hasStylus</tt> se establece la opci&oacute;n &quot;false&quot; (falso) si el valor de tipo de rat&oacute;n es &quot;L&aacute;piz Stylus&quot; (&lt;mouseType=&quot;Stylus&quot;/&gt;).</li>
					<li>Device Central no comprobar&aacute; si el archivo probado cumple las estrictas convenciones de nomenclatura de archivos de los dispositivos BREW. Si desea emular dispositivos BREW, aseg&uacute;rese de que el archivo cumpla las normas de BREW.</li>
				</ul>
				<strong>V&iacute;deos e im&aacute;genes incluidos en un archivo SWF</strong><br/> Los v&iacute;deos y las im&aacute;genes incluidos en un archivo SWF siempre se pueden reproducir en el emulador, independientemente de si el dispositivo real admite o no esta funci&oacute;n. Para comprobar si se admite la reproducci&oacute;n de v&iacute;deo e im&aacute;genes de un archivo SWF, seleccione los dispositivos de destino deseados, haga clic en la ficha Perfiles de dispositivos y vaya a la secci&oacute;n Flash. Si los dispositivos seleccionados admiten la reproducci&oacute;n de v&iacute;deo e im&aacute;genes del archivo SWF, aparecer&aacute;n los respectivos formatos. <br/><br/><strong>Contenido SWF incluido en p&aacute;ginas Web</strong> <br/>En Windows, el emulador no reproduce contenido de Flash incrustado en p&aacute;ginas Web. En Mac OS, Device Central utiliza el complemento de equipo de sobremesa de Flash, que puede generar resultados inesperados con el contenido de Flash Lite. <br/> <br/>Se recomienda probar el contenido de Flash Lite incrustado por separado. <br/><br/><strong>Sonido</strong>
				<ul>
					<li>Los formatos de sonido espec&iacute;ficos de BREW (como QCELP, CMX y BCI) no se reproducen.</li>
					<li>Para la funci&oacute;n <tt>soundChannels</tt> siempre se establece la opci&oacute;n &quot;Stereo&quot; (Est&eacute;reo), aun cuando s&oacute;lo se indique la admisi&oacute;n de sonidos Mono en los perfiles de dispositivos.</li>
					<li>En el reproductor Flash Lite 1.1 siempre se establece la opci&oacute;n &quot;Yes&quot; (S&iacute;) para la funci&oacute;n <tt>multipleDeviceSounds</tt>, aun cuando se indique la imposibilidad de mezclar varios sonidos en el perfil de dispositivo.</li>
					<li>Las pel&iacute;culas SWF con varios sonidos v&iacute;rgenes PCM nativos incrustados para una reproducci&oacute;n simult&aacute;nea (mezcla) pueden causar algunos problemas de calidad de reproducci&oacute;n en los reproductores Flash Lite 2.x.</li>
					<li>Podr&iacute;an existir problemas de calidad al reproducir archivos MIDI. Para mejorar la calidad, intente cambiar el sintetizador predeterminado establecido en la configuraci&oacute;n del sistema de QuickTime por General MIDI.</li>
					<li>En Mac OS, se podr&iacute;an omitir peque&ntilde;os fragmentos de sonido al comienzo.</li>
					<li>En Mac OS, se podr&iacute;an producir algunos problemas de calidad con los reproductores Flash Lite 2.x al reproducir formatos MIDI, MFI y MP3 nativos.</li>
					<li>En los equipos Mac Power, los archivos SMAF-5 podr&iacute;an omitirse y presentar cortes durante la reproducci&oacute;n.</li>
					<li>El sonido se podr&iacute;a reproducir de forma entrecortada al desplazarse r&aacute;pidamente por la ventana de la aplicaci&oacute;n. </li>
				</ul>
				<strong>Rendimiento</strong> <br/>Cada perfil de dispositivo incluye informaci&oacute;n sobre el &iacute;ndice de rendimiento resultante de la ejecuci&oacute;n de una prueba de rendimiento realizada por Adobe en el dispositivo real. Este &iacute;ndice de rendimiento permite clasificar los dispositivos. Cuanto mayor es el &iacute;ndice, mejor es el rendimiento. Para simular el rendimiento de un dispositivo en el equipo, es necesario realizar previamente un proceso de calibraci&oacute;n. Durante este proceso de calibraci&oacute;n, Device Central ejecuta el mismo archivo SWF que se ha utilizado durante la prueba de rendimiento en el dispositivo real. A continuaci&oacute;n, se establece el resultado de la calibraci&oacute;n realizada en el equipo con relaci&oacute;n al &iacute;ndice de rendimiento del dispositivo. <br/> <br/><i>Tenga en cuenta que: la simulaci&oacute;n de rendimiento es una aproximaci&oacute;n al rendimiento del dispositivo real.<br/></i><br/> El archivo SWF utilizado para la calibraci&oacute;n incluye intercalaciones de vectores, mapas de bits y texto. Por lo tanto, la simulaci&oacute;n de rendimiento ser&aacute; m&aacute;s precisa para este tipo de contenido. Algunas funciones, como las funciones de red, ActionScript y an&aacute;lisis de XML, no se tienen en cuenta en esta prueba de rendimiento. <br/> <br/> Para lograr la mayor precisi&oacute;n posible en los resultados de la simulaci&oacute;n, se debe realizar frecuentemente una calibraci&oacute;n del dispositivo, ya que el rendimiento se ve afectado por otros procesos que se ejecutan en el equipo. La prueba final siempre se debe realizar en el dispositivo real.<br/> <br/><strong>Comandos de FSCommand2</strong><br/> SetFullScreen: Cada archivo SWF se emula en modo de pantalla completa.<br/>
				
				<br/>SetInputTextType: El emulador ignora las restricciones de introducci&oacute;n de texto de caracteres latinos y no latinos.<br/> <br/>
				
				Los siguientes comandos de FSCommand2 se emulan como si se admitieran, aun cuando el perfil de dispositivo contenga una informaci&oacute;n diferente.<br/>
				
				<br/>Todos los reproductores Flash Lite: 
				
				<ul>
					<li>Escape, Unescape&nbsp;</li>
					<li>GetFreePlayerMemory, GetTotalPlayerMemory</li>
					<li>GetTimezoneOffset&nbsp;<br/>
					</li>
				</ul>
				Reproductores Flash Lite 2.x:
				
				<ul>
					<li>GetDateDay, GetDateMonth, GetDateWeekday, GetDateYear</li>
					<li>GetTimeHour, GetTimeMinute, GetTimeSecond
					</li>
				</ul>
			</div>
			<div id="title">
				<a name="A9" id="A9"></a><h2>Servicio de atenci&oacute;n al cliente</h2>
			</div>
			<div id="description">
				<strong>Servicio de atenci&oacute;n al cliente</strong><br/> El servicio de atenci&oacute;n al cliente de Adobe proporciona asistencia relacionada con informaci&oacute;n de productos, ventas, registros y otras cuestiones de tipo no t&eacute;cnico. Para obtener informaci&oacute;n sobre la forma de ponerse en contacto con el servicio de atenci&oacute;n al cliente de Adobe, visite la p&aacute;gina principal de Adobe.com de su regi&oacute;n o pa&iacute;s y haga clic en el enlace de contacto.<br/> <br/> <strong>Recursos t&eacute;cnicos y opciones del plan de asistencia</strong><br/> Si necesita recibir asistencia t&eacute;cnica para su producto, incluida informaci&oacute;n sobre recursos de resoluci&oacute;n de problemas y opciones de asistencia de tipo gratuito y de pago, puede obtener m&aacute;s informaci&oacute;n en <a href="http://www.adobe.com/go/support_es/">http://www.adobe.com/go/support_es/</a>. Si se encuentra fuera de Norteam&eacute;rica, visite <a href="http://www.adobe.com/go/intlsupport_es/">http://www.adobe.com/go/intlsupport_es/</a>. Los recursos de resoluci&oacute;n de problemas de tipo gratuito incluyen los foros de usuarios de Adobe y la base de conocimientos de asistencia de Adobe, entre otros muchos.</div>
			<div id="title">
				<a name="A10" id="A10"></a><h2>Otros recursos</h2>
			</div>
			<div id="description">
				<strong>Documentaci&oacute;n</strong><br/> Puede solicitar documentaci&oacute;n impresa en <a href="http://www.adobe.com/go/buy_books_es">www.adobe.com/go/buy_books_es</a>.<br/> <br/> <strong>Recursos en l&iacute;nea</strong><br/>Mobile and Devices Developer Center: <a href="http://www.adobe.com/go/mobiledeveloper_es">www.adobe.com/go/mobiledeveloper_es</a>.<a href="http://www.adobe.com/go/mobiledeveloper_es"><br/></a>Developer Center: <a href="http://www.adobe.com/go/developer_es">www.adobe.com/go/developer_es</a>.</div>
			<div id="title">
				<a name="A11" id="A11"></a><h2>Avisos legales</h2>
			</div>
			<div id="description">
				Las imágenes de dispositivos móviles se proporcionan con este software con propósitos de simulación exclusivamente y no pueden implementar la tecnología de Adobe cuando se comercialice por parte del fabricante de dispositivos aplicables.<br/>
				<br/> Informaci&oacute;n actualizada e informaci&oacute;n de c&oacute;digo de otros fabricantes adicional disponible en <a href="http://www.adobe.com/go/thirdparty_es/">www.adobe.com/go/thirdparty_es</a>.</div>
		</div>
	
</body>

</html>
	  
	